;~ =============================================================================
;~ Rizonesoft Language File
;~ =============================================================================
;~ Date.........: 01 January 2018
;~ Author.......: Derick Payne (Rizonesoft)
;~ Link.........: www.rizonesoft.com
;~ =============================================================================

[Main]
Product = Complete Internet Repair
Version = 8

[Language]
;~ Please ad the translated language name next to the english name. For example; Ελληνικά - Greek
Name = English
Code = en
Encoding = Unicode (UTF-16) LE BOM

[Translations]
;~ Please do not translate this section.
About = About
Custom = Custom
Donate = Donate
File = File
Logging = Logging
Menus = Menus
Messages = Messages
Messages2 = Messages2
Preferences = Preferences
Update = Update
Versioning = Versioning

[About]
Window_Title = About %{Program.Name}
Label_Version = Version
Label_AutoIt = Build with AutoIt version
Label_Copyright = Copyright
Tip_Title_Donate = Donate to our Cause
Tip_Message_Donate = When you donate, you help keep our software free\rnand enable us to acquire the tools and services\rnwe use to serve you. 
Label_Home = Homepage
Label_License = License
Label_Support = Get Support
Tip_Title_Country = Made in South Africa
Tip_Message_Country = %{Program.Name} was born in South Africa.
Label_Contributors = Contributors
Tip_Facebook = Like us on Facebook.
Tip_Twitter = Follow us on Twitter.
Tip_GooglePlus = Find us on Google.
Tip_GitHub = %{Program.Name} on GitHub.
Button_Ok = Ok
Label_RAM = (RAM) %d MB FREE OF %d MB (%d%)
Tip_RAM = Random Access Memory
Label_HDD = (%s) %.2f GB FREE OF %.2f GB (%d%)

[Custom]
Label_Status_Welcome = Remember! Never fix something that is not broken, you could break stuff.
Label_Status_Updates = Checking for Updates
Checkbox_Repair_01 = Reset Internet Protocols (TCP/IP)
Checkbox_Repair_02 = Repair Winsock (Reset Catalog)
Checkbox_Repair_03 = Renew Internet Connections
Checkbox_Repair_04 = Flush DNS Resolver Cache (Domain Name System)
Checkbox_Repair_05 = Flush ARP Cache (Address Resolution Protocol)
Checkbox_Repair_06 = Repair Internet Explorer %s
Checkbox_Repair_07 = Clear Windows Update History
Checkbox_Repair_08 = Repair Windows / Automatic Updates
Checkbox_Repair_09 = Repair SSL / HTTPS / Cryptography
Checkbox_Repair_10 = Reset Proxy Server Configuration
Checkbox_Repair_11 = Reset Windows Firewall Configuration
Checkbox_Repair_12 = Restore the default hosts file
Checkbox_Repair_13 = Renew Wins Client Registrations
Checkbox_Repair_14 = Make Network Computers Visible in File Explorer
Tip_Status_Show = Show Status
Tip_Status_Hide = Hide Status
Button_Go = Go!
Button_Go_Stop = Stop
Info_01 = Before you start; it is recommended that you create a System Restore Point to roll back any changes made by Complete Internet Repair. Furthermore, run the build-in Windows Internet Troubleshooters before any repair options.\rn\rnSelect your repair options and press '%s' to start. Do not select something unless your computer has the described problem. Skip any option you do not understand.
Info_02 = This option rewrites important registry keys that are used by the Internet Protocol (TCP/IP) stack. This has the same result as removing and reinstalling the protocol.
Info_03 = This can be used to recover from Winsock corruption result in lost of network connectivity. This option should be used with care becuase any pre-installed LSP's will need to be reinstalled.
Info_04 = Release and renew all Internet (TCP/IP) connections.
Info_05 = Flush DNS Resolver Cache, refresh all DHCP leases and re-register DNS names.
Info_06 = ARP (Address Resolution Protocol) Cache is a technique used to store 'mappings' of OSI Model Network Layer addresses (IP addresses) to corresponding OSI Model Data Link addresses (MAC addresses). Due to a variety of possible circumstances, ARP cache can become damaged.\rn\rnSymptoms include: numerous websites fail to load, and interruptions in network or internet connectivity. The Ping command will also fail to work for communicating with two or more remote hosts.
Info_07 = Re-registers all the concerned dll and ocx files required for a smooth operation of Microsoft Internet Explorer %s.
Info_08 = This option will clear the Windows Update History. It will do this by emptying the '%s' and '%s' directories.
Info_09 = This option will try and fix Windows Update / Automatic Updates. Try this when you are unable to download or install updates.
Info_10 = If you are having trouble connecting to SSL / Secured websites (Ex. Banking) then this option could help.
Info_11 = Many malware infections create proxy servers and then set Windows to route all web traffic through the virus proxy. For example, an attempt to access Rizonesoft.com, will redirect to a malware site.\rn\rnThis option will attempt to reset all proxy configurations, including persistent WinHTTP proxy configuration.
Info_12 = Reset the Windows Firewall configuration to its default state.
Info_13 = Reset the Windows hosts file to its default state.
Info_14 = It is sometimes necessary that clients or servers on your network need to reregister their NetBIOS names with a Windows Internet Name Service (WINS) server.\rn\rnHere are some situations where renewing WINS client registrations would be necessary: The registration has been lost or deleted in WINS and needs to be refreshed by the client. The registration exists in some WINS servers but not in others. A reregistration is useful here to increment the WINS version Ids, which will help in causing a WINS server replication to occur.
Info_15 = By default, computers in your local network should be visible when browsing for a network device with File Explorer. With Windows 10 version 1803 some computers are only accessible via their names or IP addresses.
Label_Sub_Heading_Notice = Complete Internet Repair functionality now bundled with Complete Windows Repair. Click here to download it now and evolve!!
Label_All_Complete = All selected tasks Complete.
Checkbox_Select_All = Select All
Checkbox_Select_None = Select None

[Donate]
Label_Heading = How about a small donation to keep our software forever free?
Label_Message = Click on the PayPal button below, choose an amount, and send us the donation. Your donation will be used to improve our software and keep everything free on Rizonesoft. A $20 donation will keep us going for at least a month.
Label_Donate = Would you consider a small gift of $10 to help us improve %{Program.Name} and keep the lights on?

[File]
Backup_Saving = Saving '%s'.
Backup_Success = The directory was successfully saved to '%s'.
Backup_Continue = We will now continue with removing it.
Backup_Error_01 = '%s' could not be saved.
Backup_Error_02 = To avoid data loss, this directory will not be removed.
CleanDir_Clearing = Clearing '%s'.
CleanDir_Error_01 = Directory Path
CleanDir_Error_02 = Nothing Here '%s'
CleanDir_Error_03 = '%s' could not be removed.
CleanDir_Attributes = Setting attributes for '%s'.
CleanDir_Success = Successfully removed '%s'.
Delete_Removing = Removing '%s'.
Delete_Success = The file was successfully deleted.
Delete_Error = An error occurred whilst deleting the file.
OpenText_Opening = Opening '%s'
OpenText_Success = Showing '%s' file.
OpenText_Error = Could not find the '%s' file.

[Logging]
Finished = Finished
success = success
Response_Received = Response Received
Successfully = Successfully
OK = OK!
Registration_succeeded = Registration succeeded
Initiated = Initiated
Error = error
Failed = failed
Access_Denied = Access is denied
No_Operation_Performed = No operation can be performed
VERSION = VERSION
File_Not_Found = Could not find the '%s' log File.
Showing_File = Showing '%s' log File.
Showing_Error = Something went wrong: Process ID: %s
Opening_File = Opening the log File.
Opening_Directory = Opening the log Folder...
Directory_Not_Found = Could not find the '%s' log Directory.
Showing_Directory = Showing '%s' log Directory.
Bool_Yes = Yes
Bool_No = No
Info_Date = Date:
Info_Program = Program:
Info_Program_Path = Program Path:
Info_Compiled = Compiled:
Info_AutoIt_Version = AutoIt Version:
Info_AutoIt_64Bit = AutoIt 64-Bit Version:
Info_Windows_Version = Windows Version:
Info_System_Type = System Type:
Info_Memory = Memory (RAM):
Info_ProgramFiles = Program Files Directory:
Info_Windows_Directory = Windows Directory:
Level_Error = Error:
Level_Warning = Warning:
Level_Success = Success:
Level_Finished = Finished:

[Menus]
File = &File
File_Event_Log = Windows &Event Viewer
File_Preferences = &Preferences
File_Logging = &Logging
File_Logging_Open_File = Open &log File
File_Logging_Open_Directory = Open log &Directory
File_Logging_IP_Reset = Open &IP reset log
File_Export = &Export (information)
File_Export_IP = &IP Configuration (all)
File_Export_LSP = Winsock &LSPs
File_Export_ARP = &ARP Entries (all)
File_Export_NBIOS = Net&BIOS Statistics
File_Reboot = &Reboot Windows
File_Close = &Close\tAlt+F4
Maintenance = &Maintenance
Maintenance_Restore = &Create a Windows Restore Point
Troubleshoot = &Troubleshoot
Troubleshoot_01 = Network Diagnostics &Web (Internet)
Troubleshoot_02 = Network Diagnostics Network &Adapter
Troubleshoot_03 = I&nternet Diagnostic
Troubleshoot_04 = Network Diagnostics &Inbound
Troubleshoot_05 = &Home Group Diagnostic
Troubleshoot_06 = Network Diagnostics &File Share
Troubleshoot_07 = &BITS Diagnostic
Troubleshoot_08 = Windows &Update Diagnostic
Troubleshoot_09 = Internet E&xplorer Diagnostic
Troubleshoot_10 = Internet Explorer &Security Diagnostic
Troubleshoot_11 = Internet Sp&eed Test
Troubleshoot_12 = Get Router &Passwords
Tools = T&ools
Tools_RDP = &Remote Desktop Connection
Tools_IE_Properties = Internet &Explorer properties
Tools_Install_IP6 = &Install IP6 protocol
Tools_Uninstall_IP6 = &Uninstall IP6 protocol
Tools_Repair_WorkView = Repair &Workgroup Computers view
Help = &Help
Help_Update = Check for &updates
Help_Home = %{Company.Name} &Home
Help_Downloads = More &Downloads
Help_Support = &Get Support
Help_Issue = Create an &issue
Help_Donate = Donate to &our Cause 
Help_About = About %{Program.Name}
Debug = &Debug

[Messages]
Info_Title = Please Take Note
Warning_Title = Warning!
Error_Title = Oops! Something went wrong!
Error_Oops = Oops!
Singleton = Another occurence of %{Program.Name} is already running.
Compatible = %{Program.Name} is not compatable with your version of windows. If you believe this to be an error, please feel free to leave a message at '%s' with all the details.
Compatible_Bit = Unfortuantely %{Program.Name} 32 Bit is not compatible with your Windows version. Please download %{Program.Name} 64 Bit from '%s'
Loading_Initializing = Initializing %{Program.Name}
Loading_Localizations = Loading Localizations
Loading_Resources = Setting Resources
Loading_WorkingDirectories = Setting Working Directories
Loading_Logging = Initializing Logging
Loading_Configuration = Loading Configuration
Loading_Shortcuts = Setting Keyboard Shortcuts
Loading_Interface = Starting Core Interface
Ping_Check_Connection = Checking Internet Connection.
Ping_Response = Response Received in %s milliseconds.
Ping_Host_Offline = Host is Offline.
Ping_Host_Unreachable = Host is Unreachable.
Ping_Host_Bad = Bad Destination.
Ping_Host_No_Internet = No Internet Connection.
Global_Errors = Finished with (%02i) %s!
Global_Errors_Error = error
Global_Errors_Errors = errors
Global_Finished = Completed selected task.
Global_File = file
Global_Files = files
RegisterDll_Success = RegSvr32.exe > '%s' registration succeeded.
RegisterDll_Error_01 = RegSvr32.exe > '%s' To register a module, you must provide a binary name.
RegisterDll_Error_02 = RegSvr32.exe > '%s' Specified module not found.
RegisterDll_Error_03 = RegSvr32.exe > '%s' Module loaded but entry-point DllRegisterServer was not found.
RegisterDll_Error_04 = RegSvr32.exe > '%s' Error number: 0x80070005
Registry_Write_Error = Could not write to '%s'
Registry_Error_01 = Unable to open requested key.
Registry_Error_02 = Unable to open requested main key.
Registry_Error_03 = Unable to open requested value.
Registry_Error_04 = Value type not supported.
Registry_Error_05 = Unable to delete requested value.
Registry_Error_06 = Unable to delete requested key/value.

[Messages2]
Select_Something_Title = Select Something
Select_Something_Message = How about selecting something first?
Stopping = Please wait!
Boot_01 = A system reboot may be required before the settings will take effect.
Boot_02 = To Reboot or not to Reboot?
Boot_03 = You might need to reboot your computer before the settings will take effect. Would you like to reboot your computer now? Save your stuff, hold your breath and press Yes to reboot your computer. Or press No to ignore me.
Boot_04 = ^ You do not want to reboot your computer?
Boot_05 = ^ Can't argue with that. It is your computer after all.
Boot_06 = Click on '%s' and then '%s' to Reboot your computer later.
Boot_07 = Rebooting Windows...
MsgBox_Boot_Title = Reboot!
MsgBox_boot_Message = Your computer will reboot in %s seconds. This should give you enough time to save your stuff. Press Ok to reboot your computer now.
Boot_Restarting = Your computer is restarting.
Boot_Canceled = Reboot Canceled.
Reset_IP_01 = Resetting all IP configurations.
Reset_IP_02 = TCP/IP Reset log located @ '%s'.
Reset_IP_03 = Resetting IP version 4 configurations.
Reset_IP_04 = Resetting IP version 6 configurations.
Winsock_01 = Attempting to reset Winsock catalog.
Winsock_02 = It is recommended that you install Windows XP Service Pack 2 or later.
Winsock_03 = Finished resetting Winsock catalog.
Winsock_04 = Resetting Winsock using Method 1.
Winsock_05 = Resetting Winsock using Method 2.
Renew_IP_01 = Releasing and Renewing TCP/IP connections.
Renew_IP_02 = Releasing TCP/IP connections.
Renew_IP_03 = Renewing TCP/IP connections.
Renew_IP_04 = Resetting Winsock.
Renew_IP_05 = TCP/IP renewed
DNS_01 = Refreshing DNS Resolver Cache.
DNS_02 = Flushing DNS
DNS_03 = Registering DNS
DNS_04 = DNS Refreshed
ARP_01 = Flushing ARP (Address Resolution Protocol) Cache.
ARP_02 = ARP Cache Refreshed
Repair_IE_01 = Repairing Internet Explorer version %s.
Repair_IE_02 = Closing Internet Explorer. Save your work before you press OK
Repair_IE_03 = Repairing 'Open in new tab/window not working'.
Repair_IE_04 = Repairing 'Add-Ons-Manager menu entry is present but nothing happens'.
Repair_IE_05 = Repairing Simple HTML Mail API.
Repair_IE_06 = Repairing Group policy snap-in.
Repair_IE_07 = Repairing Smart Screen.
Repair_IE_08 = Repairing IEAK Branding.
Repair_IE_09 = Repairing Development Tools.
Repair_IE_10 = Repairing 'IE8 closes immediately on launch'.
Repair_IE_11 = Repairing License Manager.
Repair_IE_12 = Repairing Javascript links don't work (Robin Walker) .NET hub file.
Repair_IE_13 = Repairing VS Debugger.
Repair_IE_14 = Repairing Printing problems, open in new window.
Repair_IE_15 = Repairing 'Find on this page is blank'.
Repair_IE_16 = Repairing Process debug manager.
Repair_IE_17 = Repairing VML Renderer.
Repair_IE_18 = Fixing 'New tabs page cannot display content because it cannot access the controls'.
Repair_IE_19 = This is a result of a bug in shdocvw.dll.
Repair_IE_20 = Repairing Outlook Express.
Repair_IE_21 = Internet Explorer should function correctly now.
Clear_Update_01 = Clearing File Stores (Update History).
Clear_Update_02 = Update History Cleared.
Repair_Update_01 = Repairing Windows Update / Automatic Updates.
Repair_Update_02 = Stopping the Nero Update Service.
Repair_Update_03 = Stopping the BITS Service.
Repair_Update_04 = Stopping the Automatic Updates Service.
Repair_Update_05 = Setting BITS Security Descriptor.
Repair_Update_06 = Setting Automatic Updates Service Security Descriptor.
Repair_Update_07 = Configuring the Automatic Updates Service.
Repair_Update_08 = Configuring BITS.
Repair_Update_09 = Registering Windows Updates Dlls.
Repair_Update_10 = Restarting the Automatic Updates Service.
Repair_Update_11 = Restarting the BITS Service.
Repair_Update_12 = Restarting the Nero Update Service.
Repair_Update_13 = Clean transactional metadata on next Transactional Resource Manager mount.
Repair_Update_14 = Clearing the BITS queue.
Repair_Update_15 = Initiating Windows Updates detection right away.
Repair_Update_16 = Windows Update repaired.
SSL_Crypt_01 = Repairing SSL / HTTPS / Cryptography service.
SSL_Crypt_02 = Stopping the Cryptographic Service.
SSL_Crypt_03 = Configuring the cryptographic service.
SSL_Crypt_04 = Clearing '%s'.
SSL_Crypt_05 = '%s' Cleared.
SSL_Crypt_06 = Registering SSL / HTTPS / Cryptography DLLs.
SSL_Crypt_07 = SSL / HTTPS / Cryptography DLLs Registered.
SSL_Crypt_08 = Restarting the cryptographic service.
SSL_Crypt_09 = Online banking should work now.
Reset_Proxy_01 = Resetting proxy settings.
Reset_Proxy_02 = Setting proxy to direct access.
Reset_Proxy_03 = Proxy settings reset to defaults.
Reset_Firewall_01 = Resetting Windows Firewall configuraton.
Reset_Firewall_02 = Firewall settings reset to defaults.
Restore_HOSTS_01 = Restoring the default Windows HOSTS file.
Restore_HOSTS_02 = An error occurred whilst writing the hosts file.
Restore_HOSTS_03 = Writing data to the HOSTS file.
Restore_HOSTS_04 = HOSTS file created successfully.
Restore_HOSTS_05 = HOSTS file restored.
Renew_Wins_01 = Renewing Wins Client Registrations.
Renew_Wins_02 = Wins Client Registrations Renewed.
Make_Computers_Visible_01 = Making Network Computers Visible.
Make_Computers_Visible_02 = Configuring the Function Discovery Resource Publication Service.
Make_Computers_Visible_03 = Network Computers should now be visible in File Explorer.
Open_Events_01 = Opening Windows Event Viewer.
Open_Events_02 = Event Viewer should be open now.
Export_IP_01 = Exporting Windows IP Configuration.
Export_IP_02 = Windows IP Configuration Saved to '%s'
Export_IP_03 = Could not save IP Configuration.
Export_LSPs_01 = Exporting Installed Winsock LSPs.
Export_LSPs_02 = Winsock LSPs list Saved to '%s'
Export_LSPs_03 = Could not save LSP list.
Export_ARP_01 = Exporting ARP entries.
Export_ARP_02 = ARP entries Saved to '%s'
Export_ARP_03 = Could not save ARP entries.
Export_NBIOS_01 = Exporting NetBIOS Statistics.
Export_NBIOS_02 = NetBIOS Statistics Saved to '%s'
Export_NBIOS_03 = Could not save NetBIOS Statistics.
Tools_Open_RDP_01 = Opening Remote Desktop Connection.
Tools_Open_RDP_02 = Could not open Remote Desktop Connection.
Tools_Open_RDP_03 = Remote Desktop Connection should be Open.
Tools_Open_IE_Properties_01 = Opening Internet Explorer Properties.
Tools_Open_IE_Properties_02 = Could not open Internet Explorer Properties.
Tools_Open_IE_Properties_03 = You should see Internet Explorer Properties.
Tools_Install_IP6 = Installing the TCP/IP v6 protocol.
Tools_Uninstall_IP6 = Uninstalling the TCP/IP v6 protocol.
Tools_Repair_WorkGroup = Repairing Workgroup Computers view.

[Preferences]
Window_Title = Preferences
Tab_General = General
Tab_Cache = Cache
Tab_Performance = Performance
Tab_Language = Language
Group_Redundancy = Redundancy
Group_Logging = Logging
Group_Priority = Priority
Group_Memory = Memory
Group_Language = Language
Checkbox_Backup_Folders = Backup Folders Before Removing
Checkbox_Export_IP = Export IP Configuration before resetting
Checkbox_Enable_Logging = Enable logging
Label_Log_Exceed = Log size must not exceed :
Label_Logging_Size = Logging Size: %s KB
Button_Logging_Clear = Clear Logging
Label_SetPriority = Set process priority:
Checkbox_SaveRealtime = Save priority above high (not recommended).
Checkbox_ReduceMemory = Reduce memory on low memory systems.
Label_Language_Message = Select the language you prefer and press the %s button to continue. (Restart Required)
Button_Save = Save
Button_Cancel = Cancel
Label_Updated = Preferences Updated
Label_Logging_Cleared = Logging cleared
MsgBox_Language_Title = Language Changed
MsgBox_Language_Message = The selected language has changed. Complete Internet Repair should be restarted for the chosen language to take effect.
MsgBox_Closing_Title = Closing %{Program.Name}
MsgBox_Closing_Message = Would you like to close %{Program.Name} now?

[Update]
Window_Title_Available = Update available
Window_Title_Congratulations = Congratulations!
Window_Title_Error = Something went wrong!
Label_Message_Update = There is a new version of '%{Program.Name}' available.
Label_Message_Latest = You are using the latest version of '%{Program.Name}'.
Label_Message_Error = Information about the latest version of '%{Program.Name}' could not be retrieved.
Label_Message_Internet = Please check your Internet Connection and try again.
Label_Build_Current = Current Build:
Label_Build_Update = Update Build:
CheckBox_NoUpdate = Do not check for updates at startup.
Button_Update = Read more
Button_Close = Close

[Versioning]
Administrator = Administrator
Build = Build
AutoIt_Version = using AutoIt version %{AutoIt.Version}
Bit = Bit